app/views/events/_form.html.erb

SELECT "categories".* FROM "categories"
SELECT "groups".* FROM "groups"
---
<tr>
<td><%= f.collection_select(:category_id, Category.all, :id, :name) %>
</td>
<td><%= f.collection_check_boxes(:group_ids, Group.all, :id, :name) %>