app/views/events/show.html.erb

<p>
	<% @event.groups.each do |g| %>
---
SELECT "groups".* FROM "groups" INNER JOIN "event_groupships" ON "groups"."id" = "event_groupships"."group_id" WHERE "event_groupships"."event_id" = ?  [["event_id", 6]]