app/controllers/events_controller.rb

SELECT  "events".* FROM "events"  WHERE "events"."user_id" = ?  ORDER BY created_at LIMIT 5 OFFSET 0  [["user_id", 1]]
SELECT COUNT(*) FROM "events"  WHERE "events"."user_id" = ?  [[nil, 1]]
---
def index
  sort_by = (params[:order] == 'name') ? 'name' : 'created_at'
  @events = current_user.events.order(sort_by).page(params[:page]).per(5)

UPDATE "events" SET "category_id" = ?, "description" = ?, "name" = ?, "updated_at" = ? WHERE "events"."id" = 10  [["category_id", 3], ["description", "fdadadfa"], ["name", "ffdadfa"], ["updated_at", "2014-10-28 03:01:32.013207"]]
---
def update
	flash[:notice] = "event was successfully updated"
  if @event.update_attributes(event_params)

DELETE FROM "events" WHERE "events"."id" = ?  [["id", 1]]
---
def destroy
	flash[:alert] = "event was successfully deleted"
  @event.destroy

INSERT INTO "events" ("category_id", "created_at", "description", "name", "updated_at") VALUES (?, ?, ?, ?, ?)  [["category_id", 1], ["created_at", "2014-10-28 08:17:34.718362"], ["description", "Calvin"], ["name", "Calvin"], ["updated_at", "2014-10-28 08:17:34.718362"]]
---
def create


	flash[:notice] = "event was successfully created"
  @event = Event.new(event_params)

  @event.user = current_user


  if @event.save

SELECT  "events".* FROM "events"  WHERE (name like '%b%') LIMIT 5 OFFSET 0
SELECT COUNT(*) FROM "events"  WHERE (name like '%b%')
---
def search
    @events = Event.where( [ "name like ?", "%#{params[:keyword]}%" ]).page(params[:page]).per(5)

SELECT  "events".* FROM "events"  WHERE "events"."id" = ? LIMIT 1  [["id", 13]]
---
def dashboard
    @event = Event.find(params[:id])